### Setup

In [1]:
import pandas as pd
import numpy as np

In [2]:
df1 = pd.DataFrame({
    'city': ['New York', 'Chicago', 'Orlando', 'Baltimore'],
    'temp': [21, 14, 35, 32]
})

df1

        city  temp
0   New York    21
1    Chicago    14
2    Orlando    35
3  Baltimore    32

In [3]:
df2 = pd.DataFrame({
    'city': ['New York', 'Chicago', 'San Fransisco'],
    'humidity': [65, 68, 71]
})

df2

            city  humidity
0       New York        65
1        Chicago        68
2  San Fransisco        71

# DataFrame Intersection
Our data have some intersection, such as ___New York___ and ___Chicago___, but also exclusive differences for ___Orlando___ and ___Baltimore__ in the first and ___San Fransisco___ in the second DataFrame.

In [5]:
pd.merge(df1, df2, on='city')

       city  temp  humidity
0  New York    21        65
1   Chicago    14        68

We can see that this way only the __intersecting rows__ are kept during merge. The differences are discarded.

# DataFrame Union
If we want the __union__ of the DataFrames, or to keep all rows, regardless or intersection, then we can specify it using the `how` kwarg and passing `outer`. 

_The default merge we saw above had `how=inner`._

In [6]:
pd.merge(df1, df2, on='city', how='outer')

            city  temp  humidity
0       New York  21.0      65.0
1        Chicago  14.0      68.0
2        Orlando  35.0       NaN
3      Baltimore  32.0       NaN
4  San Fransisco   NaN      71.0